In [136]:
#blok 1
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.naive_bayes import GaussianNB
df = pd.read_csv("adult.csv")
df.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K

In [137]:
#blok 2
df.drop(['native-country','fnlwgt','relationship','race','occupation','marital-status','education','workclass','capital-gain','capital-loss'],axis='columns',inplace=True)
df.head()

   age  educational-num  gender  hours-per-week income
0   25                7    Male              40  <=50K
1   38                9    Male              50  <=50K
2   28               12    Male              40   >50K
3   44               10    Male              40   >50K
4   18               10  Female              30  <=50K

In [138]:
#blok 3
inputs = df.drop('income',axis='columns')
target = df.income
target.head()

0    <=50K
1    <=50K
2     >50K
3     >50K
4    <=50K
Name: income, dtype: object

In [139]:
#blok 4
dummies = pd.get_dummies(inputs.gender)
dummies.head(3)

   Female  Male
0       0     1
1       0     1
2       0     1

In [140]:
#blok 5
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   age  educational-num gender  hours-per-week  Female  Male
0   25                7   Male              40       0     1
1   38                9   Male              50       0     1
2   28               12   Male              40       0     1

In [141]:
#blok 6
inputs.drop(['gender','Female'],axis='columns',inplace=True)
inputs.head(3)

   age  educational-num  hours-per-week  Male
0   25                7              40     1
1   38                9              50     1
2   28               12              40     1

In [142]:
#blok 7
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [143]:
# #blok 8
# inputs.Age[:20]

In [144]:
# # blok 9
# inputs.Age = inputs.Age.fillna(inputs.Age.mean())
# inputs.head()

In [149]:
#blok 10
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [150]:
#blok 11
model = GaussianNB()
model.fit(X_train,y_train)
model.score(X_test,y_test)

0.8092947077490019

In [127]:
#blok 12
X_test[0:10]

       age  fnlwgt  educational-num  hours-per-week  Male
36275   33  143851               13              40     0
48364   51   43909                9              40     0
19031   47  122026               11              50     1
44731   36   66173               12              15     0
17287   66  271567                9              40     1
20366   37  243425                9              50     0
31662   44  167005                9              48     1
3478    26  182380                9              40     1
12373   21  227521               10              15     0
47977   90  313986                9              40     1

In [128]:
#blok 13
y_test[0:10]

36275    <=50K
48364    <=50K
19031    <=50K
44731    <=50K
17287    <=50K
20366    <=50K
31662     >50K
3478     <=50K
12373    <=50K
47977     >50K
Name: income, dtype: object

In [129]:
#blok 14
model.predict(X_test[0:10])

array(['<=50K', '<=50K', '<=50K', '<=50K', '<=50K', '<=50K', '<=50K',
       '<=50K', '<=50K', '<=50K'], dtype='<U5')

In [130]:
#blok 15
model.predict_proba(X_test[:10])

array([[0.74571965, 0.25428035],
       [0.69520204, 0.30479796],
       [0.54529648, 0.45470352],
       [0.93309084, 0.06690916],
       [0.71954384, 0.28045616],
       [0.70535075, 0.29464925],
       [0.63960211, 0.36039789],
       [0.89164783, 0.10835217],
       [0.98445461, 0.01554539],
       [0.94230117, 0.05769883]])